import pandas as pd
import pytest

from src.reports import spending_by_category


@pytest.fixture
def transactions_excel_df():
    test_list = [
        {
            "Дата операции": "15.07.2019 23:37:42",
            "Дата платежа": "17.07.2019",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -77.36,
            "Валюта операции": "RUB",
            "Сумма платежа": -77.36,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "SPAR",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 77.36,
        },
        {
            "Дата операции": "15.07.2019 20:00:31",
            "Дата платежа": "15.07.2019",
            "Номер карты": 0,
            "Статус": "OK",
            "Сумма операции": -50000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -50000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Переводы",
            "MCC": 0,
            "Описание": 'На р/с ООО "ФОРТУНА"',
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 50000.0,
        },
        {
            "Дата операции": "15.07.2019 16:55:34",
            "Дата платежа": "16.07.2019",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -120.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -120.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Фастфуд",
            "MCC": 5814.0,
            "Описание": "IP Yakubovskaya M. V.",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 120.0,
        },
        {
            "Дата операции": "15.07.2019 16:50:10",
            "Дата платежа": "17.07.2019",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -114.19,
            "Валюта операции": "RUB",
            "Сумма платежа": -114.19,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Супермаркеты",
            "MCC": 5499.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 114.19,
        },
        {
            "Дата операции": "15.07.2019 13:43:11",
            "Дата платежа": "17.07.2019",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -200.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -200.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Ж/д билеты",
            "MCC": 4111.0,
            "Описание": "Метро Санкт-Петербург",
            "Бонусы (включая кэшбэк)": 4,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 200.0,
        },
    ]

    return pd.DataFrame(test_list)


def test_spending_by_category_2(transactions_excel_df) -> None:
    result = spending_by_category(transactions_excel_df, "Супермаркеты", "2019-07-15 23:37:42")
    expected = (
        '[{"Дата операции": "15.07.2019 23:37:42", "Дата платежа": "17.07.2019", "Номер карты": "*7197", '
        '"Статус": "OK", "Сумма операции": -77.36, "Валюта операции": "RUB", "Сумма платежа": -77.36,'
        ' "Валюта платежа": "RUB", "Кэшбэк": 0, "Категория": "Супермаркеты", "MCC": 5411.0, "Описание": "SPAR", '
        '"Бонусы (включая кэшбэк)": 1, "Округление на инвесткопилку": 0, "Сумма операции с округлением": 77.36}, '
        '{"Дата операции": "15.07.2019 16:50:10", "Дата платежа": "17.07.2019", "Номер карты": "*7197", '
        '"Статус": "OK", "Сумма операции": -114.19, "Валюта операции": "RUB", "Сумма платежа": -114.19, '
        '"Валюта платежа": "RUB", "Кэшбэк": 0, "Категория": "Супермаркеты", "MCC": 5499.0, "Описание": '
        '"Колхоз", "Бонусы (включая кэшбэк)": 2, "Округление на инвесткопилку": 0, '
        '"Сумма операции с округлением": 114.19}]'
    )

    assert result == expected


def test_spending_by_category_not_transactions(transactions_excel_df) -> None:
    result = spending_by_category(transactions_excel_df, "Супермаркеты", "2021-07-15 23:37:42")
    expected = "Трат по заданной категории за последние три месяца нет."
    assert result == expected
